- [[http://www.rubylife.jp/ini/][ruby入門]] [[file:ruby-note.org][ruby note]] [[http://docs.ruby-lang.org/ja/2.0.0/doc/index.html][リファレンスマニュアル]] 

  [[http://docs.ruby-lang.org/ja/2.0.0/doc/s][変数と定数 (Ruby 2.0.0)]]


* 変数 http://www.rubylife.jp/ini/var/          変数 - Ruby入門

** 変数への代入 

   変数への代入
   : 変数 = 値

   多重代入
   ： 変数1, 変数2, 変数3 = 値1, 値2, 値3

#+BEGIN_SRC ruby :session ruby :results output
x1 = 10

x1, x2, x3 = 1, 2, 3

x1, x2, x3 = [1, 2, 3]

'end'
#+END_SRC   

#+RESULTS:
: 10
: [1, 2, 3]
: [1, 2, 3]

** 変数の種類

   http://docs.ruby-lang.org/ja/2.0.0/doc/s 変数と定数 (Ruby 2.0.0)

   - グローバル変数 
   - ローカル変数
     
   - インスタンス変数
   - クラス変数
   - 定数

** Ruby予約語


： BEGIN    class    ensure   nil      self     when
： END      def      false    not      super    while
： alias    defined? for      or       then     yield
： and      do       if       redo     true
： begin    else     in       rescue   undef
： break    elsif    module   retry    unless
： case     end      next     return   until

変数名としては使用できません。 

** 自己代入 
** 多重代入 

* スコープ

  講義後半で説明します。

  Block/Module
   - ローカル変数
   - グローバル変数 

   Object
   - インスタンス変数

   Class
   - クラス変数

   Module/Class (?) - ((*自信なし*))
   - 定数

  
